# GetPressLossCalculationServerInfo Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSettings..::..GetPressLossCalculationServerInfo Method
DuctSettings Class See Also
---
Get the MEPServerInfo of the current pipe pressure loss calculation server.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public MEPCalculationServerInfo GetPressLossCalculationServerInfo()
```

Visual Basic
---
```text
Public Function GetPressLossCalculationServerInfo As MEPCalculationServerInfo
```

Visual C++
---
```text
public:
MEPCalculationServerInfo^ GetPressLossCalculationServerInfo()
```

# ### Return Value
The MEPServerInfo of the current pipe pressure loss calculation server
# See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace